Autodesk.Navisworks.Api.PublishProperties
Set of properties used when publishing a file

Autodesk.Navisworks.Api.PublishProperties.#ctor
Default constructor

Autodesk.Navisworks.Api.PublishProperties.#ctor(Autodesk.Navisworks.Api.PublishProperties)
Copy constructor
Throws System.ArgumentNullException:
Argument 'value' is null
Throws System.ArgumentException:
Argument 'value' has been Disposed

Autodesk.Navisworks.Api.PublishProperties.AllowResave
Can the file be resaved after it has been published ?
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.PublishProperties.Author
Who created data ?
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.PublishProperties.Comments
Any comments
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.PublishProperties.Copyright
Any copyright statement
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.PublishProperties.DisplayAtPassword
Should the publish properties be displayed when asking the user for a password ?
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.PublishProperties.DisplayOnOpen
Should the publish properties be displayed when the published file is opened ?
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.PublishProperties.EmbedDatabaseProperties
Should any properties from linked databases be embedded in the published file ?
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.PublishProperties.ExpiryDate
Date that content expires. Only valid if HasExpiryDate is true.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.PublishProperties.HasBeenResaved
Has the published file been resaved (and possibly modified) since it was published ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.PublishProperties.HasExpiryDate
Is there a valid expiry date ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.PublishProperties.HasPassword
Is the content password protected ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.PublishProperties.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.PublishProperties.Keywords
Any keywords for searching
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.PublishProperties.PublishDate
Date of publication
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.PublishProperties.PublishedFor
Who's the data intended for ?
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.PublishProperties.Publisher
Who published data ?
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.PublishProperties.RemoveExpiryDate
Remove any expiry date that has been set
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.PublishProperties.RemovePassword
Remove any password that has been set
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.PublishProperties.SetPassword(System.String)
Set a password to protect the content with when published
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.PublishProperties.Subject
Subject
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.PublishProperties.Title
Title of published content
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only